Tekla.Structures.TeklaStructuresInternal.Filtering.FilterExpressionGeneratorFactory
This API supports the Open API infrastructure and is not intended to be used directly from your code. Use the Tekla.Structures.Filtering.Filter class instead.

Tekla.Structures.TeklaStructuresInternal.Filtering.FilterExpressionGeneratorFactory.CreateGenerator
This API supports the Open API infrastructure and is not intended to be used directly from your code. Use the Tekla.Structures.Filtering.Filter class instead.
Creates a filter generator.
Returns: A new filter generator.

Tekla.Structures.TeklaStructuresInternal.Filtering.FilterExpressionGeneratorFactory.CreateGenerator(Tekla.Structures.TeklaStructuresInternal.Filtering.FilterExpressionGeneratorType)
This API supports the Open API infrastructure and is not intended to be used directly from your code. Use the Tekla.Structures.Filtering.Filter class instead.
Creates a filter generator of a specific type.
FilterExpressionGeneratoryType: The filter generator type to be used.
Returns: A new filter generator.